dkwill/nRF52_MD612_Quats_Accel_wBLE/ble_peripheral/ble_app_md612/md612.c
*   @defgroup  eMPL
 *   @brief     Embedded Motion Processing Library
 *
 *   @{
 *       @file      mllite_test.c
 *       @brief     Test app for eMPL using the Motion Driver DMP image.
 */
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#include "app_error.h"
#include "nrf_delay.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "boards.h"
    
#include "inv_mpu.h"
#include "inv_mpu_dmp_motion_driver.h"
#include "invensense.h"
#include "invensense_adv.h"
#include "eMPL_outputs.h"
#include "mltypes.h"
#include "mpu.h"
#include "log.h"
#include "packet.h"

#include "inv_pesky.h"
#include "md612.h"

#ifdef PYTHON_UART
/* Data read from MPL. */
#define PRINT_ACCEL     (0x01)
#define PRINT_GYRO      (0x02)
#define PRINT_QUAT      (0x04)
#define PRINT_COMPASS   (0x08)
#define PRINT_EULER     (0x10)
#define PRINT_ROT_MAT   (0x20)
#define PRINT_HEADING   (0x40)
#define PRINT_PEDO      (0x80)
#define PRINT_LINEAR_ACCEL (0x100)
#define PRINT_GRAVITY_VECTOR (0x200)
#endif

#define ACCEL_ON        (0x01)
#define GYRO_ON         (0x02)
#define COMPASS_ON      (0x04)

/* Starting sampling rate. */
#define DEFAULT_MPU_HZ  (200)

// #define FLASH_SIZE      (512)
// #define FLASH_MEM_START ((void*)0x1800)

#define PEDO_READ_MS    	(1000)
#define TEMP_READ_MS    	(500)
#define COMPASS_READ_MS 	(10)

#define BLE_EULER_MS_SLOW   (200)		// if nothing has moved send the euler info every 15 seconds.
#define BLE_EULER_MS_FAST	(0)		// if there is motion send it every .5 seconds.


/* USB RX binary semaphore. Actually, it's just a flag. Not included in struct
 * because it's declared extern elsewhere.
 */
//volatile unsigned char rx_new;

unsigned char *mpl_key = (unsigned char*)"eMPL 5.1";

static platform_data_t const * m_platform_data;

// struct rx_s {
//     unsigned char header[3];
//     unsigned char cmd;
// };
struct hal_s {
    unsigned char lp_accel_mode;
    unsigned char sensors;
    unsigned char dmp_on;
    volatile unsigned short motion;
    //unsigned char wait_for_tap;
    volatile unsigned char new_gyro;
    volatile unsigned char new_temp;
    volatile unsigned char new_euler;
#ifdef COMPASS_ENABLED
    volatile unsigned char new_compass;
#endif
    //unsigned char motion_int_mode;
    //unsigned long no_dmp_hz;
    unsigned long next_pedo_ms;
    unsigned long next_temp_ms;
    unsigned long next_compass_ms;
    unsigned long next_ble_ms_fast;
    unsigned long next_ble_ms_slow;
    //unsigned int report;
    //unsigned short dmp_features;
    //struct rx_s rx;
};
static struct hal_s hal = {0};

/* Get data from MPL.
 * TODO: Add return values to the inv_get_sensor_type_xxx APIs to differentiate
 * between new and stale data.
 */
static void read_from_mpl(void)
{

	int8_t accuracy;
	unsigned long timestamp;

#ifdef PYTHON_UART
	long msg;
	long  data[9];
	float float_data[3] = {0};
#else
	long data[4];
#endif

	// Make sure a call back function exists.
	if (m_platform_data->cb == NULL) {
        return;
    }


   	// read the euler values and send to call back function.
//    if (inv_get_sensor_type_euler(data, &accuracy, (inv_time_t*)&timestamp)) {
//    	m_platform_data->cb(PACKET_DATA_EULER,  data, accuracy, timestamp);
//    }



//DKW Changed to get Quats
//	if (inv_get_sensor_type_quat(data, &accuracy, (inv_time_t*) &timestamp)) {
//		m_platform_data->cb(PACKET_DATA_QUAT, data, accuracy, timestamp,
//				hal.tap);
//		hal.tap = 0;
//	}


//DKW Added Accel

	if (inv_get_sensor_type_accel(data, &accuracy, (inv_time_t*) &timestamp)) {
			m_platform_data->cb(PACKET_DATA_ACCEL, data, accuracy, timestamp);

		}


    //NRF_LOG_INFO("[%d] Accuracy: %d\r\n", timestamp, accuracy);

     if (inv_get_sensor_type_quat(data, &accuracy, (inv_time_t*)&timestamp)) {
        /* Sends a quaternion packet to the PC. Since this is used by the Python
         * test app to visually represent a 3D quaternion, it's sent each time
         * the MPL has new data.
         */
         eMPL_send_quat(data);

         // /* Specific data packets can be sent or suppressed using USB commands. */
         // if (hal.report & PRINT_QUAT)
         //     eMPL_send_data(PACKET_DATA_QUAT, data);
     }

//     if (hal.report & PRINT_ACCEL) {
//         if (inv_get_sensor_type_accel(data, &accuracy,
//             (inv_time_t*)&timestamp))
//             eMPL_send_data(PACKET_DATA_ACCEL, data);
//     }
//     if (hal.report & PRINT_GYRO) {
//         if (inv_get_sensor_type_gyro(data, &accuracy,
//             (inv_time_t*)&timestamp))
//             eMPL_send_data(PACKET_DATA_GYRO, data);
//     }
// #ifdef COMPASS_ENABLED
//     if (hal.report & PRINT_COMPASS) {
//         if (inv_get_sensor_type_compass(data, &accuracy,
//             (inv_time_t*)&timestamp))
//             eMPL_send_data(PACKET_DATA_COMPASS, data);
//     }
// #endif
//     if (hal.report & PRINT_EULER) {
//         if (inv_get_sensor_type_euler(data, &accuracy,
//             (inv_time_t*)&timestamp))
//             eMPL_send_data(PACKET_DATA_EULER, data);
//     }
//     if (hal.report & PRINT_ROT_MAT) {
//         if (inv_get_sensor_type_rot_mat(data, &accuracy,
//             (inv_time_t*)&timestamp))
//             eMPL_send_data(PACKET_DATA_ROT, data);
//     }
//     if (hal.report & PRINT_HEADING) {
//         if (inv_get_sensor_type_heading(data, &accuracy,
//             (inv_time_t*)&timestamp))
//             eMPL_send_data(PACKET_DATA_HEADING, data);
//     }
//     if (hal.report & PRINT_LINEAR_ACCEL) {
//         if (inv_get_sensor_type_linear_acceleration(float_data, &accuracy, (inv_time_t*)&timestamp)) {
//         	MPL_LOGI("Linear Accel: "NRF_LOG_FLOAT_MARKER" "NRF_LOG_FLOAT_MARKER" "NRF_LOG_FLOAT_MARKER"\r\n",
//         			NRF_LOG_FLOAT(float_data[0]),
//                     NRF_LOG_FLOAT(float_data[1]),
//                     NRF_LOG_FLOAT(float_data[2]));                                        
//          }
//     }
//     if (hal.report & PRINT_GRAVITY_VECTOR) {
//             if (inv_get_sensor_type_gravity(float_data, &accuracy,
//                 (inv_time_t*)&timestamp))
//             	MPL_LOGI("Gravity Vector: "NRF_LOG_FLOAT_MARKER" "NRF_LOG_FLOAT_MARKER" "NRF_LOG_FLOAT_MARKER"\r\n",
//             			NRF_LOG_FLOAT(float_data[0]),
//                         NRF_LOG_FLOAT(float_data[1]),
//                         NRF_LOG_FLOAT(float_data[2]));
//     }
//     if (hal.report & PRINT_PEDO) {
//         unsigned long timestamp;
//         get_ms(&timestamp);
//         if (timestamp > hal.next_pedo_ms) {
//             hal.next_pedo_ms = timestamp + PEDO_READ_MS;
//             unsigned long step_count, walk_time;
//             dmp_get_pedometer_step_count(&step_count);
//             dmp_get_pedometer_walk_time(&walk_time);
//             MPL_LOGI("Walked %ld steps over %ld milliseconds..\n", step_count,
//             walk_time);
//         }
//     }

    // /* Whenever the MPL detects a change in motion state, the application can
    //  * be notified. For this example, we use an LED to represent the current
    //  * motion state.
    //  */
    // msg = inv_get_message_level_0(INV_MSG_MOTION_EVENT |
    //         INV_MSG_NO_MOTION_EVENT);
    // if (msg) {
    //     if (msg & INV_MSG_MOTION_EVENT) {
    //         MPL_LOGI("Motion!\n");
    //     } else if (msg & INV_MSG_NO_MOTION_EVENT) {
    //         MPL_LOGI("No motion!\n");
    //     }
    // }
}

#ifdef COMPASS_ENABLED
void send_status_compass() {
	long data[3] = { 0 };
	int8_t accuracy = { 0 };
	unsigned long timestamp;
	inv_get_compass_set(data, &accuracy, (inv_time_t*) &timestamp);
	MPL_LOGI("Compass: "NRF_LOG_FLOAT_MARKER" "NRF_LOG_FLOAT_MARKER" "NRF_LOG_FLOAT_MARKER" ",
			NRF_LOG_FLOAT(data[0]/65536.f),
            NRF_LOG_FLOAT(data[1]/65536.f),
            NRF_LOG_FLOAT(data[2]/65536.f));
	MPL_LOGI("Accuracy= %d\r\n", accuracy);

