dkwill/nRF52_MD612_Quats_Accel_wBLE/ble_peripheral/ble_app_md612/md612.c
    if (dmp_load_motion_driver_firmware()) {
    	MPL_LOGE("Could not download DMP.\n");
        nRF52_reset();
    }

    dmp_set_orientation(
        inv_orientation_matrix_to_scalar(m_platform_data->gyro_orientation));

    dmp_register_tap_cb(tap_cb);

    dmp_register_android_orient_cb(android_orient_cb);

    /*
     * Known Bug -
     * DMP when enabled will sample sensor data at 200Hz and output to FIFO at the rate
     * specified in the dmp_set_fifo_rate API. The DMP will then sent an interrupt once
     * a sample has been put into the FIFO. Therefore if the dmp_set_fifo_rate is at 25Hz
     * there will be a 25Hz interrupt from the MPU device.
     *
     * There is a known issue in which if you do not enable DMP_FEATURE_TAP
     * then the interrupts will be at 200Hz even if fifo rate
     * is set at a different rate. To avoid this issue include the DMP_FEATURE_TAP
     *
     * DMP sensor fusion works only with gyro at +-2000dps and accel +-2G
     */
    // hal.dmp_features = DMP_FEATURE_6X_LP_QUAT | DMP_FEATURE_TAP |
    //     DMP_FEATURE_ANDROID_ORIENT | DMP_FEATURE_SEND_RAW_ACCEL | DMP_FEATURE_SEND_CAL_GYRO |
    //     DMP_FEATURE_GYRO_CAL;


    dmp_enable_feature(DMP_FEATURE_6X_LP_QUAT | DMP_FEATURE_TAP | DMP_FEATURE_ANDROID_ORIENT |
        DMP_FEATURE_SEND_RAW_ACCEL | DMP_FEATURE_SEND_CAL_GYRO |
        DMP_FEATURE_GYRO_CAL);
    dmp_set_fifo_rate(DEFAULT_MPU_HZ);
    inv_set_quat_sample_rate(1000000L / DEFAULT_MPU_HZ);
    mpu_set_dmp_state(1);
    hal.dmp_on = 1;

    long bias[3];
    bias[0] = 6211584;
    bias[1] = -2068480;
    bias[2] = -2611200;
    inv_set_accel_bias(bias, 3);
    bias[0] = -748747;
    bias[1] = 1786825;
    bias[2] = 1045736;
    inv_set_gyro_bias(bias, 3);
    bias[0] = -10261884;
    bias[1] = 63218332;
    bias[2] = -29328029;
    inv_set_compass_bias(bias, 3);

//     dmp_set_tap_thresh(TAP_XYZ, 250);
//     dmp_set_tap_axes(TAP_XYZ);
//     dmp_set_tap_count(1);
//     dmp_set_tap_time(100);
//     dmp_set_tap_time_multi(500);

// #define DMP_SAMPLE_RATE     (200)
// #define GYRO_SF             (46850825LL * 200 / DMP_SAMPLE_RATE)

//     dmp_set_shake_reject_thresh(GYRO_SF, 100);
//     dmp_set_shake_reject_time(40);
//     dmp_set_shake_reject_timeout(10);
}

void md612_selftest()
{
    run_self_test();
    /* Let MPL know that contiguity was broken. */
    inv_accel_was_turned_off();
    inv_gyro_was_turned_off();
    inv_compass_was_turned_off();
}

void md612_beforesleep()
{       
    unsigned long timestamp;

    // uint8_t c;
    // if (app_uart_get(&c) == NRF_SUCCESS) {
    //     /* A byte has been received via USART. See handle_input for a list of
    //      * valid commands.
    //      */
    //     handle_input(c);
    // }
    get_ms(&timestamp);//MPL_LOGI("Timestamp: %d\n", timestamp);

#ifdef COMPASS_ENABLED
    /* We're not using a data ready interrupt for the compass, so we'll
        * make our compass reads timer-based instead.
        */
    if ((timestamp > hal.next_compass_ms) /*&& !hal.lp_accel_mode*/ &&
        hal.new_gyro && (hal.sensors & COMPASS_ON)) {
        hal.next_compass_ms = timestamp + COMPASS_READ_MS;
        hal.new_compass = 1;
    }
#endif
    /* Temperature data doesn't need to be read with every gyro sample.
        * Let's make them timer-based like the compass reads.
        */
    if (timestamp > hal.next_temp_ms) {
        hal.next_temp_ms = timestamp + TEMP_READ_MS;
        hal.new_temp = 1;
    }

    /* setup two timers one for sending euler slow (15sec) and fast when there is motion (.5sec)
     *
     */
    if (timestamp > hal.next_ble_ms_fast) {
    	hal.next_ble_ms_fast = timestamp + BLE_EULER_MS_FAST;
    	hal.new_euler = 1;
    	hal.motion = 1;
    }

    if (timestamp > hal.next_ble_ms_slow) {
    	hal.next_ble_ms_slow = timestamp + BLE_EULER_MS_SLOW;
    	hal.new_euler = 2;
    }
    // if (hal.motion_int_mode) {
    //     /* Enable motion interrupt. */
    //     mpu_lp_motion_interrupt(500, 1, 5);
    //     /* Notify the MPL that contiguity was broken. */
    //     inv_accel_was_turned_off();
    //     inv_gyro_was_turned_off();
    //     inv_compass_was_turned_off();
    //     inv_quaternion_sensor_was_turned_off();
    //     /* Wait for the MPU interrupt. */
    //     while (!hal.new_gyro)
    //     {
    //         // Make sure any pending events are cleared
    //         __SEV();
    //         __WFE();
    //         // Enter System ON sleep mode
    //         __WFE();
    //     }

    //     /* Restore the previous sensor configuration. */
    //     mpu_lp_motion_interrupt(0, 0, 0);
    //     hal.motion_int_mode = 0;
    // }
}

void md612_aftersleep()
{
    int new_data = 0;
    unsigned long sensor_timestamp;

//    if (hal.new_gyro) {
//    	NRF_LOG_INFO ("after sleep ngryro=%d, dmpon=%d\r\n", hal.new_gyro, hal.dmp_on);
//    }


    // if (hal.new_gyro && hal.lp_accel_mode) {
    //     short accel_short[3];
    //     long accel[3];
    //     mpu_get_accel_reg(accel_short, &sensor_timestamp);
    //     accel[0] = (long)accel_short[0];
    //     accel[1] = (long)accel_short[1];
    //     accel[2] = (long)accel_short[2];
    //     inv_build_accel(accel, 0, sensor_timestamp);
    //     new_data = 1;
    //     hal.new_gyro = 0;
    // } else
    if (hal.new_gyro && hal.dmp_on) {
        short gyro[3], accel_short[3], sensors;
        unsigned char more;
        long accel[3], quat[4], temperature;
        /* This function gets new data from the FIFO when the DMP is in
            * use. The FIFO can contain any combination of gyro, accel,
            * quaternion, and gesture data. The sensors parameter tells the
            * caller which data fields were actually populated with new data.
            * For example, if sensors == (INV_XYZ_GYRO | INV_WXYZ_QUAT), then
            * the FIFO isn't being filled with accel data.
            * The driver parses the gesture data to determine if a gesture
            * event has occurred; on an event, the application will be notified
            * via a callback (assuming that a callback function was properly
            * registered). The more parameter is non-zero if there are
            * leftover packets in the FIFO.
            */
        dmp_read_fifo(gyro, accel_short, quat, &sensor_timestamp, &sensors, &more);

        if (!more) {
            hal.new_gyro = 0;
        }

        if (sensors & INV_XYZ_GYRO) {
            /* Push the new data to the MPL. */
            inv_build_gyro(gyro, sensor_timestamp);
            new_data = 1;
            if (hal.new_temp) {
                hal.new_temp = 0;
                /* Temperature only used for gyro temp comp. */
                mpu_get_temperature(&temperature, &sensor_timestamp);
                inv_build_temp(temperature, sensor_timestamp);
            }
        }
        if (sensors & INV_XYZ_ACCEL) {
            accel[0] = (long)accel_short[0];
            accel[1] = (long)accel_short[1];
            accel[2] = (long)accel_short[2];
            inv_build_accel(accel, 0, sensor_timestamp);
            new_data = 1;
        }
        if (sensors & INV_WXYZ_QUAT) {
            inv_build_quat(quat, 0, sensor_timestamp);
            new_data = 1;
        }
    } else if (hal.new_gyro) {
        short gyro[3], accel_short[3];
        unsigned char sensors, more;
        long accel[3], temperature;
        /* This function gets new data from the FIFO. The FIFO can contain
            * gyro, accel, both, or neither. The sensors parameter tells the
            * caller which data fields were actually populated with new data.
            * For example, if sensors == INV_XYZ_GYRO, then the FIFO isn't
            * being filled with accel data. The more parameter is non-zero if
            * there are leftover packets in the FIFO. The HAL can use this
            * information to increase the frequency at which this function is
            * called.
            */
        hal.new_gyro = 0;
        mpu_read_fifo(gyro, accel_short, &sensor_timestamp, &sensors, &more);
        if (more)
            hal.new_gyro = 1;
        if (sensors & INV_XYZ_GYRO) {
            /* Push the new data to the MPL. */
            inv_build_gyro(gyro, sensor_timestamp);
            new_data = 1;
            if (hal.new_temp) {
                hal.new_temp = 0;
                /* Temperature only used for gyro temp comp. */
                mpu_get_temperature(&temperature, &sensor_timestamp);
                inv_build_temp(temperature, sensor_timestamp);
            }
        }
        if (sensors & INV_XYZ_ACCEL) {
            accel[0] = (long)accel_short[0];
            accel[1] = (long)accel_short[1];
            accel[2] = (long)accel_short[2];
            inv_build_accel(accel, 0, sensor_timestamp);
            new_data = 1;
        }
    }
#ifdef COMPASS_ENABLED
    if (hal.new_compass) {
        short compass_short[3];
        long compass[3];
        hal.new_compass = 0;
        /* For any MPU device with an AKM on the auxiliary I2C bus, the raw
            * magnetometer registers are copied to special gyro registers.
            */
        if (!mpu_get_compass_reg(compass_short, &sensor_timestamp)) {
            compass[0] = (long)compass_short[0];
            compass[1] = (long)compass_short[1];
            compass[2] = (long)compass_short[2];
            /* NOTE: If using a third-party compass calibration library,
                * pass in the compass data in uT * 2^16 and set the second
                * parameter to INV_CALIBRATED | acc, where acc is the
                * accuracy from 0 to 3.
                */
            inv_build_compass(compass, 0, sensor_timestamp);
        }
        new_data = 1;
    }
#endif
    if (new_data) {
        if(inv_execute_on_data()) {
            MPL_LOGE("ERROR execute on data\n");
        }
        
        /* This function reads bias-compensated sensor data and sensor
            * fusion outputs from the MPL. The outputs are formatted as seen
            * in eMPL_outputs.c. This function only needs to be called at the
            * rate requested by the host.
            */

        //DKW - Try Changing to Accel Data
        if (hal.new_euler) {
        	if (hal.motion) {
        		read_from_mpl();
        		hal.motion = 0;
        	}
        	// if there is not motion only send if the slow timme out has occured.
        	else if (hal.new_euler == 2) {
        		read_from_mpl();
        	}
        	hal.new_euler = 0;
        }
    }
}

     //   if (new_accel) {
        //        	if (hal.motion) {
        //        		read_from_mpl();
        //        		hal.motion = 0;
        //        	}
        //        	// if there is not motion only send if the slow timme out has occured.
        //        	else if (hal.new_euler == 2) {
        //        		read_from_mpl();
        //        	}
        //        	hal.new_euler = 0;
        //        }
        //    }
        //}

unsigned char md612_hasnewdata()
{
	return hal.sensors && hal.new_gyro;
}
